In [2]:
import pandas as pd
import numpy as np

In [5]:
titanic = pd.read_csv('C:/Users/user/Desktop/text4image/_pandas/titanic.csv')

In [6]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
titanic["surname"] = titanic["Name"].str.split(",").str.get(0)

In [11]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,surname
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen

### A pandas Series is a one-dimensional labelled data structure which can hold data such as strings, integers and even other Python objects.

In [15]:
type(titanic["Age"])

pandas.core.series.Series

#### DataFrame Series can only contain single list with index, whereas dataframe can be made of more than one series or we can say that a dataframe is a collection of series that can be used to analyse the data.

In [16]:
type(titanic)

pandas.core.frame.DataFrame

### Remember, a DataFrame is 2-dimensional with both a row and column dimension.

In [18]:
titanic.shape

(891, 13)

### How to filter specific rows from a DataFrame.

In [23]:
# select all passengers who is older than 35 years.
above_35 = titanic[titanic["Age"] > 35]

##### The condition inside the selection brackets titanic["Age"] > 35 checks for which rows the Age column has a value larger than 35: 
#### The output of the conditional expression (>, but also ==, !=, <, <=,… would work

In [24]:
above_35.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,surname
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,McCarthy
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S,Bonnell
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S,Andersson
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S,Hewlett

### Select all passengers from cabin class 2 and 3.

#### the condition inside the selection brackets titanic["Pclass"].isin([2, 3]) checks for which rows the Pclass column is either 2 or 3.

In [44]:
pclass_23 = titanic[titanic["Pclass"].isin([2,3])]

# pclasss_23 = titanic[(titanic["Pclass"]==2) | (titanic["Pclass"]==3)]

#### <span style="color: blue">When combining multiple conditional statements, each condition must be surrounded by parentheses (). </span>

####  <span style="color: purple"> _the isin()_ conditional function returns a True for each row the values are in the provided list. To filter the rows based on such a function, use the conditional function inside the selection brackets [].</span>

In [48]:
age_no_na = titanic[titanic["Age"].notna()]

The **notna()** conditional function returns a True for each row the values are not an Null value. As such, this can be combined with the selection brackets [] to filter the data table.

### How to select specific rows and columns from a DataFrame

In [49]:
adult_names = titanic.loc[titanic["Age"] > 35, "Name"]

#### The loc/iloc operators are required in front of the selection brackets []. When using loc/iloc, the part before the comma is the rows you want, and the part after the comma is the columns you want to select.

In [50]:
adult_names

1      Cumings, Mrs. John Bradley (Florence Briggs Th...
6                                McCarthy, Mr. Timothy J
11                              Bonnell, Miss. Elizabeth
13                           Andersson, Mr. Anders Johan
15                      Hewlett, Mrs. (Mary D Kingcome)
                             ...
865                             Bystrom, Mrs. (Karolina)
871     Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
873                          Vander Cruyssen, Mr. Victor
879        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
885                 Rice, Mrs. William (Margaret Norton)
Name: Name, Length: 217, dtype: object

### <span style="color: #88B04B">Retrive  rows 10 till 25 and columns 3 to 5. </span>

In [64]:
_iloc = titanic.iloc[9:25, 4:7]

In [66]:
_iloc.head(2)

       Sex   Age  SibSp
9   female  14.0      1
10  female   4.0      1